---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Point Properties
Point Class See Also Send Feedback
---

The Point type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Coord | Returns the coordinates of the point. |
|  | GraphicsStyleId | The ElementId of the GeometryObject's GraphicsStyle (Inherited from GeometryObject.) |
|  | Id | A unique integer identifying the GeometryObject in its associated non view-specific GeometryElement. (Inherited from GeometryObject.) |
|  | IsElementGeometry | Indicates whether this geometry is obtained directly from an Element. (Inherited from GeometryObject.) |
|  | IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |
|  | Reference | Returns a stable reference to the point. |
|  | Visibility | The visibility. (Inherited from GeometryObject.) |

# See Also

Point Class

Autodesk.Revit.DB Namespace